#### ExportLineweightKey Members

---

|  |
| --- |
| ExportLineweightKey Class   Constructors   Methods   Properties   See Also |

The  ExportLineweightKey  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLineweightKey | Constructs a new default ExportLineweightKey. |
| Public method | ExportLineweightKey(Int32) | Constructs a new default ExportLineweightKey using the original line weight as input. |
| Public method | ExportLineweightKey(ExportLineweightKey) | Constructs a new copy of the input ExportLineweightKey object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportLineweightKey |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OriginalLineweight | The original line weight. |

# See Also

ExportLineweightKey Class

Autodesk.Revit.DB Namespace